; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 118286 1 2 2 5 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	Star0 - direction
	Star1 - direction
	Star3 - direction
	Star2 - direction
	GroundStation4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Star5 thermograph0)
	(have_image Planet6 spectrograph1)
	(have_image Planet7 spectrograph1)
	(have_image Star8 spectrograph1)
	(have_image Star9 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite0 star9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 5
4. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 5
5. (turn_to satellite0 star9 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
6. (take_image satellite0 star9 instrument1 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 1 of 5
7. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 1 of 5
8. (take_image satellite0 star8 instrument1 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 2 of 5
9. (turn_to satellite0 star5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star5)
   goals met: 2 of 5
10. (take_image satellite0 star5 instrument1 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 3 of 5
11. (turn_to satellite0 planet7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet7)
   goals met: 3 of 5
12. (take_image satellite0 planet7 instrument1 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 4 of 5
13. (turn_to satellite0 planet6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet6)
   goals met: 4 of 5
14. (take_image satellite0 planet6 instrument1 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 5 of 5
